zephray/RhythmPocketLite/fw/rhythmpocketlite_core0/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins_Core0
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins_Core0(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t I2C_SCL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_13 (pin 71)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_I2C_SCL_GPIO, BOARD_INITPINS_CORE0_I2C_SCL_PORT, BOARD_INITPINS_CORE0_I2C_SCL_PIN, &I2C_SCL_config);

    gpio_pin_config_t I2C_SDA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_14 (pin 72)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_I2C_SDA_GPIO, BOARD_INITPINS_CORE0_I2C_SDA_PORT, BOARD_INITPINS_CORE0_I2C_SDA_PIN, &I2C_SDA_config);

    gpio_pin_config_t LCD_PWR_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin 14)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_LCD_PWR_EN_GPIO, BOARD_INITPINS_CORE0_LCD_PWR_EN_PORT, BOARD_INITPINS_CORE0_LCD_PWR_EN_PIN, &LCD_PWR_EN_config);

    gpio_pin_config_t PB_STAT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_26 (pin 60)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_PB_STAT_GPIO, BOARD_INITPINS_CORE0_PB_STAT_PORT, BOARD_INITPINS_CORE0_PB_STAT_PIN, &PB_STAT_config);

    gpio_pin_config_t SW_SE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_28 (pin 66)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_SW_SE_GPIO, BOARD_INITPINS_CORE0_SW_SE_PORT, BOARD_INITPINS_CORE0_SW_SE_PIN, &SW_SE_config);

    gpio_pin_config_t SW_LE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin 40)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_SW_LE_GPIO, BOARD_INITPINS_CORE0_SW_LE_PORT, BOARD_INITPINS_CORE0_SW_LE_PIN, &SW_LE_config);

    gpio_pin_config_t HOLD_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_11 (pin 93)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_HOLD_GPIO, BOARD_INITPINS_CORE0_HOLD_PORT, BOARD_INITPINS_CORE0_HOLD_PIN, &HOLD_config);

    gpio_pin_config_t SW_A_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_12 (pin 67)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_SW_A_GPIO, BOARD_INITPINS_CORE0_SW_A_PORT, BOARD_INITPINS_CORE0_SW_A_PIN, &SW_A_config);

    gpio_pin_config_t LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_16 (pin 87)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_LED_GPIO, BOARD_INITPINS_CORE0_LED_PORT, BOARD_INITPINS_CORE0_LED_PIN, &LED_config);

    gpio_pin_config_t SW_RI_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_17 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_SW_RI_GPIO, BOARD_INITPINS_CORE0_SW_RI_PORT, BOARD_INITPINS_CORE0_SW_RI_PIN, &SW_RI_config);

    gpio_pin_config_t EXT_PWR_GOOD_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_18 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_EXT_PWR_GOOD_GPIO, BOARD_INITPINS_CORE0_EXT_PWR_GOOD_PORT, BOARD_INITPINS_CORE0_EXT_PWR_GOOD_PIN, &EXT_PWR_GOOD_config);

    gpio_pin_config_t PMIC_ON_REQ_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_19 (pin 58)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_PMIC_ON_REQ_GPIO, BOARD_INITPINS_CORE0_PMIC_ON_REQ_PORT, BOARD_INITPINS_CORE0_PMIC_ON_REQ_PIN, &PMIC_ON_REQ_config);

    gpio_pin_config_t SW_UP_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_22 (pin 41)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_SW_UP_GPIO, BOARD_INITPINS_CORE0_SW_UP_PORT, BOARD_INITPINS_CORE0_SW_UP_PIN, &SW_UP_config);

    gpio_pin_config_t SW_DN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_23 (pin 42)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_SW_DN_GPIO, BOARD_INITPINS_CORE0_SW_DN_PORT, BOARD_INITPINS_CORE0_SW_DN_PIN, &SW_DN_config);

    gpio_pin_config_t SW_B_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_26 (pin 68)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_SW_B_GPIO, BOARD_INITPINS_CORE0_SW_B_PORT, BOARD_INITPINS_CORE0_SW_B_PIN, &SW_B_config);

    gpio_pin_config_t SW_ST_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_30 (pin 65)  */
    GPIO_PinInit(BOARD_INITPINS_CORE0_SW_ST_GPIO, BOARD_INITPINS_CORE0_SW_ST_PORT, BOARD_INITPINS_CORE0_SW_ST_PIN, &SW_ST_config);

    IOCON->PIO[0][13] = ((IOCON->PIO[0][13] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_OD_MASK)))

                         /* Selects pin function.
                          * : PORT013 (pin 71) is configured as PIO0_13. */
                         | IOCON_PIO_FUNC(PIO0_13_FUNC_ALT0)

